{
	"AcceptedFactionInvite": "Triggered when a faction invite has been accepted.",
	"AcceptedSafehouseInvite": "Triggered when a safehouse invite has been accepted.",
	"AcceptedTrade": "Triggered when a trade request has been accepted.",
	"AddXP": "Triggered when a player gains XP.",
	"Attack": "Triggered when a character is performing an attack.",
	"AutoDrink": "Triggered when a character is drinking automatically.",
	"CalculateStats": "Triggered when a character stats are being calculated.",
	"DoSpecialTooltip": "Triggered when a special tooltip is being rendered, after a user right-clicked an object.",
	"EveryDays": "Triggered every day at midnight (in-game).",
	"EveryHours": "Triggered every hour (in-game).",
	"EveryOneMinute": "Triggered every minute (in-game).",
	"EveryTenMinutes": "Triggered every ten minutes (in-game).",
	"LevelPerk": "Triggered when a perk is being leveled up.",
	"LoadGridsquare": "Triggered when a square is being loaded.",
	"MngInvReceiveItems": "Triggered when the game client is receiving inventory items from the server.",
	"OnAIStateChange": "Triggered before an AI state is being changed.",
	"OnAIStateEnter": "Triggered when an AI state is being entered.",
	"OnAIStateExecute": "Triggered when an AI state is being executed.",
	"OnAIStateExit": "Triggered when an AI state is being exited.",
	"OnAcceptInvite": "Triggered when a Steam invite has been accepted.",
	"OnAddBuilding": "Triggered when a building is being added to the map.",
	"onAddForageDefs": "Triggered when the forage definitions are being added.",
	"OnAddMessage": "Triggered when a chat message is being sent.",
	"OnAdminMessage": "Triggered when a chat message from the server admin is being sent.",
	"OnAmbientSound": "Triggered when an ambient sound starts.",
	"OnBeingHitByZombie": "Triggered when a character is being hit by a zombie.",
	"OnCGlobalObjectSystemInit": "Triggered when the client global object system is being initialized.",
	"OnChallengeQuery": "Triggered when the challenge options are getting populated.",
	"OnChangeWeather": "Triggered when the weather is changing.",
	"OnCharacterCollide": "Triggered when two characters collide together.",
	"OnCharacterCreateStats": "Triggered when the stats of a character are being created.",
	"OnCharacterDeath": "Triggered when a character dies.",
	"OnCharacterMeet": "Triggered when a survivor meets another character.",
	"OnChatWindowInit": "Triggered when the chat window is being initialized.",
	"OnClientCommand": "Triggered when the player sends a command to the server.",
	"OnClimateManagerInit": "Triggered after the ClimateManager has been initialized.",
	"OnClimateTick": "Triggered for every climate tick.",
	"OnClimateTickDebug": "Triggered for every climate tick but only when debug mode is enabled.",
	"OnClothingUpdated": "Triggered when a character's clothing items are updated.",
	"OnConnectFailed": "Triggered when the connection to the server has failed.",
	"OnConnected": "Triggered when the player successfully connects to the server.",
	"OnConnectionStateChanged": "When a player is connecting to the server, the connection is going through different stages. This event is triggered for each of these stages of the initial connection.",
	"OnContainerUpdate": "Triggered when a container is being updated.",
	"OnCoopJoinFailed": "Triggered when a player fails to join a cooperative game.",
	"OnCoopServerMessage": "Triggered when the player receives a server message during a cooperative game.",
	"OnCreateLivingCharacter": "Triggered when either a player or survivor is being created.",
	"OnCreatePlayer": "Triggered when a player is being created.",
	"OnCreateSurvivor": "Triggered when a survivor is being created.",
	"OnCreateUI": "Triggered after UI initialization.",
	"OnCustomUIKey": "Triggered when a custom UI key has been released.",
	"OnCustomUIKeyPressed": "Triggered when a custom UI key has been pressed.",
	"OnCustomUIKeyReleased": "Triggered when a custom UI key has been released.",
	"OnDawn": "Triggered at dawn.",
	"OnDestroyIsoThumpable": "Triggered when a thumpable object is being destroyed.",
	"OnDeviceText": "Triggered when a media device is displaying text.",
	"onDisableSearchMode": "Triggered when search mode is being disabled.",
	"OnDisconnect": "Triggered when the player disconnects from the server.",
	"OnDistributionMerge": "Triggered before merging the world distribution.",
	"OnDoTileBuilding": "Triggered when a building tile is being set.",
	"OnDoTileBuilding2": "Triggered when a building tile is being set.",
	"OnDoTileBuilding3": "Triggered when a building tile is being set.",
	"OnDusk": "Triggered at dusk.",
	"OnDynamicMovableRecipe": "Triggered when a dynamic recipe for a movable inventory item is being used.",
	"onEnableSearchMode": "Triggered when search mode is being enabled.",
	"OnEnterVehicle": "Triggered when a player successfully enters a vehicle.",
	"OnEquipPrimary": "Triggered when a character equips an item in its primary slot.",
	"OnEquipSecondary": "Triggered when a character equips an item in its secondary slot.",
	"OnExitVehicle": "Triggered when a character is exiting a vehicle.",
	"OnFETick": "Same as OnTick, except is only called while on the main menu.",
	"OnFillContainer": "Triggered after a container has been filled.",
	"OnFillInventoryObjectContextMenu": "Triggered when inventory object context menus are being filled.",
	"onFillSearchIconContextMenu": "TODO",
	"OnFillWorldObjectContextMenu": "Triggered when world object context menus are being filled.",
	"OnGameBoot": "Triggered when either a game or a server is being started, or when mods are getting reloaded during a game.",
	"OnGameStart": "Triggered after the start of a new game, and after a saved game has been loaded.",
	"OnGameTimeLoaded": "Triggered after the [[GameTime]] has been initialized.",
	"OnGamepadConnect": "Triggered when a gamepad has been connected.",
	"OnGamepadDisconnect": "Triggered when a gamepad has been disconnected.",
	"OnGetDBSchema": "Triggered when the game client is receiving a database schema from the server.",
	"OnGetTableResult": "Triggered when the game client is receiving a table result from the server.",
	"OnGridBurnt": "Triggered when a grid square is burning.",
	"OnHitZombie": "Triggered when a character hits a zombie.",
	"OnInitGlobalModData": "Triggered after GlobalModData has been initialized.",
	"OnInitModdedWeatherStage": "Triggered when the modded weather state is being initialized.",
	"OnInitRecordedMedia": "Triggered when a media is being recorded.",
	"OnInitSeasons": "Triggered when the seasons have been initialized.",
	"OnInitWorld": "Triggered during the process of initializing the world.",
	"OnIsoThumpableLoad": "Triggered when a thumpable object is being loaded.",
	"OnIsoThumpableSave": "Triggered when a thumpable object is being saved.",
	"onItemFall": "Triggered when an item is being dropped on the ground.",
	"OnJoypadActivate": "Triggered when a joypad is activated in-game.",
	"OnJoypadActivateUI": "Triggered when joypad is activated from main screen.",
	"OnJoypadBeforeDeactivate": "Triggered when a joypad was disconnected, just before being deactivated.",
	"OnJoypadBeforeReactivate": "Triggered when a joypad was connected, just before being activated.",
	"OnJoypadDeactivate": "Triggered when a joypad was disconnected, just after it's been deactivated.",
	"OnJoypadReactivate": "Triggered when a joypad was connected, just after it's been activated.",
	"OnJoypadRenderUI": "Triggered every time the screen is being rendered, whether in-game or on main screen.",
	"OnKeyKeepPressed": "Triggered when a keyboard key is being held down.",
	"OnKeyPressed": "Triggered when a keyboard key is being pressed.",
	"OnKeyStartPressed": "Triggered when a keyboard key is initially being pressed.",
	"OnLoad": "Triggered when a game is loading, after [[Modding:Lua Events/OnGameStart|OnGameStart]].",
	"OnLoadMapZones": "Triggered when IsoWorld initialises and is registering the zones for the map.",
	"OnLoadRadioScripts": "Triggered when radio scripts are being loaded.",
	"OnLoadSoundBanks": "Triggered when sound banks are loaded for the game.",
	"OnLoadedTileDefinitions": "Triggered after tiles definitions have been loaded.",
	"OnLoginState": "Used when entering login state (?)",
	"OnLoginStateSuccess": "When LoginState succeeds.",
	"OnMainMenuEnter": "Triggered when main menu is displayed to users. This can occur either when they launch the game, or when they quit a running game.",
	"OnMakeItem": "Triggered when a player is crafting an item.",
	"OnMapLoadCreateIsoObject": "No trigger found for this event.",
	"OnMechanicActionDone": "Triggered when a player finished a mechanic action.",
	"OnMiniScoreboardUpdate": "Triggered when the mini scoreboard is being updated.",
	"OnModsModified": "Triggered when a mod has been modified on the filesystem.",
	"OnMouseDown": "Triggered when the mouse button is down.",
	"OnMouseMove": "Triggered when the mouse is moved.",
	"OnMouseUp": "Triggered when the mouse button is released.",
	"OnMultiTriggerNPCEvent": "Called when a player enters the trigger area of a NPC event.",
	"OnNPCSurvivorUpdate": "Triggered when a survivor is being updated.",
	"OnNewFire": "Triggered when a fire starts.",
	"OnNewGame": "Triggered after a new world has been initialized.",
	"OnNewSurvivorGroup": "Triggered when a new survivor group is being created.",
	"OnObjectAboutToBeRemoved": "Triggered when an object is about to get removed.",
	"OnObjectAdded": "Triggered when an object is added to the map.",
	"OnObjectCollide": "Triggered when a character collides with an object.",
	"OnObjectLeftMouseButtonDown": "Triggered when left mouse button clicked on [[IsoObject]]",
	"OnObjectLeftMouseButtonUp": "Triggered when left mouse button is released on [[IsoObject]]",
	"OnObjectRightMouseButtonDown": "Triggered when right mouse button clicked on [[IsoObject]]",
	"OnObjectRightMouseButtonUp": "Triggered when right mouse button is released on [[IsoObject]]",
	"OnPlayerAttackFinished": "Triggered when a character is done performing an attack.",
	"OnPlayerCancelTimedAction": "Triggered when a player cancels a timed action.",
	"OnPlayerDeath": "Triggered when a player dies.",
	"OnPlayerMove": "Triggered while the player is moving.",
	"OnPlayerSetSafehouse": "Triggered when survivor group has their safehouse set.",
	"OnPlayerUpdate": "Triggered when a player is being updated.",
	"OnPostCharactersSquareDraw": "No trigger found for this event.",
	"OnPostDistributionMerge": "Triggered after the distribution merge.",
	"OnPostFloorLayerDraw": "Triggered after a floor layer is rendered.",
	"OnPostFloorSquareDraw": "No trigger found for this event.",
	"OnPostMapLoad": "Triggered after a cell is loaded.",
	"OnPostRender": "Triggered every time after a frame is rendered in-game.",
	"OnPostSave": "Triggered after a game has been saved.",
	"OnPostTileDraw": "No trigger found for this event.",
	"OnPostTilesSquareDraw": "No trigger found for this event.",
	"OnPostUIDraw": "Triggered by UI Manager in its render function after the UI has been drawn.",
	"OnPostWallSquareDraw": "No trigger found for this event.",
	"OnPreDistributionMerge": "Triggered before the distribution merge.",
	"OnPreFillInventoryObjectContextMenu": "Triggered before context menus get filled with options.",
	"OnPreFillWorldObjectContextMenu": "Triggered before context menu for world objects is filled.",
	"OnPreGameStart": "Triggered before [[Modding:Lua Events/GameStart]].",
	"OnPreMapLoad": "Triggered before a map is loaded.",
	"OnPreUIDraw": "Triggered by UI Manager in its render function before the UI gets drawn.",
	"OnPressRackButton": "Triggered when a player hits the button to rack a firearm.",
	"OnPressReloadButton": "Triggered when a player hits the  button to reload a firearm.",
	"OnRadioInteraction": "Triggered when a radio is displaying a new line of text.",
	"OnRainStart": "Triggered when it starts rainning.",
	"OnRainStop": "Triggered when it stops raining.",
	"OnReceiveGlobalModData": "Triggered when the game client is receiving GlobalModData from the server.",
	"OnReceiveItemListNet": "Triggered when a player is receiving a list of items from another player.",
	"OnReceiveUserlog": "Triggered when the game client is receiving user log from the server.",
	"OnRefreshInventoryWindowContainers": "Triggered during the process of refreshing inventory containers.",
	"OnRenderTick": "Triggered every time the display is being rendered.",
	"OnRenderUpdate": "Triggered every time Display.update() is called.",
	"OnResetLua": "Triggered when Lua is being reset.",
	"OnResolutionChange": "Triggered when game resolution has changed.",
	"OnRightMouseDown": "Triggered when right mouse button is down.",
	"OnRightMouseUp": "Triggered when mouse button is released.",
	"OnSGlobalObjectSystemInit": "Triggered when the server global object system is being initialized.",
	"OnSafehousesChanged": "Triggered when the safehouse is being changed.",
	"OnSave": "Triggered during the game's saving process.",
	"OnScoreboardUpdate": "Triggered when multiplayer scoreboard is updated.",
	"OnSeeNewRoom": "Triggered for each room about to get spawned, the first time a character gets close enough to the building where the room is located.",
	"OnServerCommand": "Triggered when a command from the server is being received.",
	"OnServerFinishSaving": "Triggered when the server is done saving.",
	"OnServerStartSaving": "Triggered when the server starts saving.",
	"OnServerStarted": "Triggered when the game server has started.",
	"OnServerStatisticReceived": "Triggered when the game client receives statistics from the server.",
	"OnServerWorkshopItems": "TODO",
	"OnSetDefaultTab": "Triggered when the default chat tab has been set.",
	"OnSpawnRegionsLoaded": "Triggered after spawn regions are loaded.",
	"OnSteamFriendStatusChanged": "Triggered when the status of a friend changed on Steam.",
	"OnSteamGameJoin": "Triggered when joining a game through Steam.",
	"OnSteamRefreshInternetServers": "Triggered when the list of public Internet servers is being refreshed.",
	"OnSteamRulesRefreshComplete": "TODO",
	"OnSteamServerFailedToRespond2": "TODO",
	"OnSteamServerResponded": "TODO",
	"OnSteamServerResponded2": "TODO",
	"OnSteamWorkshopItemCreated": "Triggered after a new Steam workshop item was successfully created.",
	"OnSteamWorkshopItemNotCreated": "Triggered when a Steam workshop item couldn't be created.",
	"OnSteamWorkshopItemNotUpdated": "Triggered when a Steam workshop item couldn't be updated.",
	"OnSteamWorkshopItemUpdated": "Triggered after a Steam workship item was successfully updated.",
	"OnSwitchVehicleSeat": "Triggered when a character is switching seat in a vehicle.",
	"OnTabAdded": "Triggered when a chat tab is added.",
	"OnTabRemoved": "Triggered when a chat tab is closed.",
	"OnThunderEvent": "Triggered when a thunderstorm is about to start.",
	"OnTick": "Triggered every tick, try to not use this one, use EveryTenMinutes instead because it can create a lot of frame loss/garbage collection.",
	"OnTickEvenPaused": "Same as OnTick, but triggered when the game is paused as well.",
	"OnTileRemoved": "Triggered when a tile object has been removed.",
	"onToggleSearchMode": "Triggered when search mode is being toggled.",
	"OnTriggerNPCEvent": "Called when a player enters the trigger area of a NPC event.",
	"onUpdateIcon": "TODO",
	"OnUpdateModdedWeatherStage": "Triggered when the modded weather sage is being updated.",
	"OnUseVehicle": "Triggered when a character is using a vehicle.",
	"OnVehicleDamageTexture": "Triggered when the texture of a vehicle part is changed after being damaged.",
	"OnVehicleHorn": "Triggered when a character is using a vehicle horn.",
	"OnWaterAmountChange": "Triggered when the amount of water in an object has changed.",
	"OnWeaponHitCharacter": "Triggered when a character has been hit by a weapon.",
	"OnWeaponHitTree": "Triggered when a character hits a tree with a hand weapon.",
	"OnWeaponHitXp": "Triggered when a player is gaining XP for a successful hit.",
	"OnWeaponSwing": "Triggered when a player swings a hand weapon.",
	"OnWeaponSwingHitPoint": "Triggered when a hand weapon has reached the apex of its swing.",
	"OnWeatherPeriodComplete": "Triggered when a weather period is complete.",
	"OnWeatherPeriodStage": "Triggered when a weather period stage starts.",
	"OnWeatherPeriodStart": "Triggered when a weather period starts.",
	"OnWeatherPeriodStop": "Triggered when a weather period stops.",
	"OnWorldMessage": "Triggered when a world message is being received.",
	"OnWorldSound": "Triggered when a sound is being played.",
	"OnZombieDead": "Triggered when a zombie dies.",
	"OnZombieUpdate": "Triggered when a zombie is being updated.",
	"preAddCatDefs": "Triggered before foraging category definitions are being added.",
	"preAddForageDefs": "Triggered before foraging definitions are being added.",
	"preAddItemDefs": "Triggered before foraging item definitions are being added.",
	"preAddZoneDefs": "Triggered before foraging zone definitions are being added.",
	"ReceiveFactionInvite": "Triggered when a player is invited to join a faction.",
	"ReceiveSafehouseInvite": "Triggered when a player is invited to a safehouse.",
	"RequestTrade": "Triggered when a character is requesting a trade with another character.",
	"ReuseGridsquare": "Triggered when a grid square is being reused.",
	"SendCustomModData": "Triggered when the game server is sending custom ModData to the client.",
	"ServerPinged": "Triggered when the game client receives the response after intiating a ping to a server.",
	"SwitchChatStream": "Triggered when a user presses TAB on his keyboard to switch chat stream.",
	"SyncFaction": "Triggered when a faction is being synced by the server on client side.",
	"TradingUIAddItem": "Triggered when a player adds an item to a trade.",
	"TradingUIRemoveItem": "Triggered when a player removes an item from a trade.",
	"TradingUIUpdateState": "Triggered when a player updates the item state of a trade.",
	"UseItem": "Triggered when a player is using an item.",
	"ViewTickets": "Triggered when the game client is receiving tickets from the server.",
	"WeaponHitCharacter": "Triggered when a character is being hit with a hand weapon.",
	"WeaponSwing": "Triggered when a character enters the swipe state.",
	"WeaponSwingHitPoint": "Triggered when a character gains XP from a successful hit with a hand weapon.",
	"onLoadModDataFromServer": "Triggered after ModData has been received from the server."
}
